---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementIdParameterValue Constructor
ElementIdParameterValue Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ElementIdParameterValue()()()() | Default constructor |
|  | ElementIdParameterValue(ElementId) | Value constructor |

# See Also

ElementIdParameterValue Class

ElementIdParameterValue Members

Autodesk.Revit.DB Namespace